app/controllers/products_controller.rb

SELECT  `products`.* FROM `products`  ORDER BY id ASC LIMIT 20
---
  def index
    @products = Product.order("id ASC").limit(20)

SELECT  `products`.* FROM `products` WHERE (title LIKE('%%')) LIMIT 20
---
  def search
    # 検索フォームのキーワードをあいまい検索して、productsテーブルから20件の作品情報を取得する
    @products = Product.where('title LIKE(?)', "%#{params[:keyword]}%").limit(20)