app/controllers/reviews_controller.rb

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
  def new
    @product = Product.find(params[:product_id])

INSERT INTO `reviews` (`nickname`, `rate`, `review`, `product_id`, `created_at`, `updated_at`) VALUES ('wada', 1, 'dfafda', 1, '2017-06-08 12:55:40', '2017-06-08 12:55:40')
---
  def create
    Review.create(create_params)